// СТРОКИ - ПРОДОЛЖЕНИЕ

// МЕТОДЫ
// length, toUpperCase(), toLowerCase(), 
// trim(), trimStart(), trimEnd(), includes(),
// startsWith(), endsWith(), slice(), replace(a, b), 
// replaceAll(a, b), split(", "), join(" ")

// ДОМАШНЕЕ ЗАДАНИЕ
// ЗАДАНИЕ 1 - ПРОВЕРКА ЛОГИНА
// Запросить логин и проверить, что после удаления
// пробелов он содержит минимум 4 символа

// ЗАДАНИЕ 2 - КОЛИЧЕСТВО СЛОВ
// Попросить пользователя ввести предложение 
// и посчитать количество слов,
// учитывая несколько пробелов подряд

// ЗАДАНИЕ 3 - ОБРАБОТКА СПИСКА
// Пользователь вводит названия товаров через запятую.
// Разделить строку на массив, удалить лишние пробелы 
// и вывести каждый товар с новой строки

// ЗАДАНИЕ 4 - ПРОВЕРКА РАСШИРЕНИЯ ФАЙЛА
// Запросите имя файла и определите, заканчивается ли 
// оно на .jpg, .png, .pdf, .doc, .mp3, .mp4 
// Вывести тип файла - фото, документ, аудиофайл, видеофайл

// ЗАДАНИЕ 5 - КРАТКОЕ ОПИСАНИЕ
// Попросить пользователя ввести текст. Если он длиннее 50 символов,
// сократите его до 50 символов и добавьте ...
// вывести в консоль

